#!/usr/bin/env python3
# -*- coding: utf-8 -*-

'rule mould. '

__author__ = 'ZHU Guilong'


# 系统默认规则

'''
规则涉及的模块：
1. element

规则
制定一些特殊的规则，来判定一些事情，比如：
1. 周末加班，费用会翻倍；
2. 法定节假日，费用会三倍；
3. 越快完成越好；
4. 如果当天没有完成，又小于3小时的，晚上自主加班，费用计算；
当前需要解决的问题是：
1. 如何把规则数字化？
2. 如何落实到计算中？
下一阶段的工作
'''


class Rule():
    ''' 
    规则
    制定一些特殊的规则，来判定一些事情，比如：
    1. 周末加班，费用会翻倍；
    2. 法定节假日，费用会三倍；
    3. 越快完成越好；
    4. 如果当天没有完成，又小于3小时的，晚上自主加班，费用计算；
    当前需要解决的问题是：
    1. 如何把规则数字化？
    2. 如何落实到计算中？

    '''

    def __init__(self) -> None:
        pass
